using System.Collections.Generic;

namespace MMG_IIA.Common
{
    public class BaseGBGroup
    {
        public static readonly Dictionary<string, string> baseNames = new Dictionary<string, string>()
        {
            {"1", "ブラッセル"},
            {"2", "グラベンスティン"},
            {"3", "ウィスケルケー"},
            {"4", "シメイ"},
            {"5", "モダーヴ"},
            {"6", "サルヴァトール"},
            {"7", "バーフ"},
            {"8", "カンブル"},
            {"9", "イーペル"},
            {"10", "コルトレイク"},
            {"11", "クリストフ"},
            {"12", "モンス"},
            {"13", "ワーヴル"},
            {"14", "ナミュール"},
            {"15", "クインティヌス"},
            {"16", "ランベール"},
            {"17", "サンジャック"},
            {"18", "ミヒャエル"},
            {"19", "シャルルロア"},
            {"20", "エノー"},
            {"21", "アルゼット"},
            {"22", "アイン"},
            {"23", "テファレト"},
            {"24", "イエソド"},
            {"25", "ケテル"},
            {"26", "マルクト"},
            {"27", "ガネット"},
            {"28", "ルラ"},
            {"29", "クシェル"},
            {"30", "フロライト"},
            {"31", "オニキス"},
            {"32", "ジルコン"},
            {"33", "ラペン"},
            {"34", "アメト"},
            {"35", "ファリア"},
            {"36", "シトリ"},
            {"37", "トパズ"},
            {"38", "メラル"},
            {"39", "ペリド"},
            {"40", "ラピス"},
            {"41", "マリン"},
            {"42", "ラリマル"},
        };
    }
}
